export const text_for_start = `
Привет, коллега! 👋  

Я — Лекси, твоя умная и немного хитрая лисичка из Альфа Банка 🦊  
Моя задача — помогать тебе ориентироваться в банке, учиться новому, находить новых друзей (или коллег) и зарабатывать крутые призы.  
И да, я не только умею говорить, но ещё и знаю всё про внутренние правила, историю банка и где спрятаны полезные документы 😏 

 📌 Что я могу?
`;

export const text_for_quiz = `
Ты любишь тесты? Нет? Не беда — мы их сделали такими, что даже кот Дзынь просится на пересдачу! 🤪  

Каждую неделю ты будешь получать кейсы, тесты по продуктам и интересным фактам.
Можно проходить повторно, чтобы закрепить материал, а главное — заработать баллы и подняться в рейтинге!  
💡Совет: Чем больше правильных ответов — тем круче твой профиль и выше шанс выиграть приз.

Можно проходить повторно, чтобы закрепить материал, а главное — заработать баллы и подняться в рейтинге!  
💡Совет: Чем больше правильных ответов — тем круче твой профиль и выше шанс выиграть приз.

📚 Выберите квиз для прохождения:
`;

export const text_for_collega = `
Тиндер имчез, а я нет ;) Встречай своего нового друга (или просто интересного человека). Мы выбираем сотрудников из разных отделов и регионов, чтобы ты мог расширить круг общения, узнать, чем занимаются другие команды, и, возможно, найти себе пару😉  
`;

export const varCodes = {
  'Переключение на B2': '8000339',
  'Переключение на ipoteka, Режим работы: ежедневно, пн-вс с 6:00 до 20:00 мск':
    '20234',
  'Переключение на Sell (группа продаж)': '20067',
  'ОКВ (6:00–21:00 по мск)': '20239',
  Арест: '8000237',
  'Переключение на Block (только блокировка и разблокировка — карты и УЦД)':
    '21929',
  'Входящая линия': '8 800 200 00 00',
  'Входящая линия (дополнительный номер)': '8 495 788 88 78',
  'Альфа-Страхование Жизнь (8:00–20:00 по мск)': '8 800 333 84 48',
  'Москва (круглосуточно)': '8 495 788 09 99',
  'Регионы (круглосуточно)': '8 800 333 09 99',
  'Приемная (пн–пт 9:00–18:00)': '8 495 620 91 91',
  'Доп. номер приемной': '8 495 974 25 15',
  HumanHelp: '8 800 707 72 27',
  HelpDesk: '0133777',
  'Справка, с 9 до 18 по мск': '8 800 303 11 11',
  'Переключение на ACLUB_Customers с DIALER': '21123',
  'Переключение на Affluent с DIALER': '20167',
  'Переключение на SME (юр. лица), круглосуточно': '20228',
  'Переключение на English (обслуживание англоязычных клиентов)': '20013',
  'Альфа-Инвестиции': '21200',
  'Партнер A-Money': '20760',
  'Удержание_КК (с 9:00 до 21:00 по мск)': '8 800 700 77 00',
  'Завершение заявки на КК (с 8:00 до 21:00 по мск)': '21157',
  'Доп. номер завершения заявки': '21122',
  'Банк Х5': '8 800 505 20 00',
  'Альфа-Трэвел (бронирование отелей и билетов)': '20891',
  'Альфа-Трэвел (доп. номер)': '8 495 641 40 01',
};

const text1 = `
Ты начинаешь как Стажёр, а по мере накопления баллов поднимаешься по карьерной лестнице знаний:

- Стажёр (0–20 баллов) – только начал путь.
- Новичок (20–100 баллов) – уже знаешь, где находится кофе-машина и как сбросить сессию.
- Ученик (100–200  баллов) – регулярно участвуешь в тестах и развиваешься.
- Профессионал (200–500 баллов) – твой уровень знаний растёт, ты можешь помочь новичкам.
- Эксперт (500–1000 баллов) – ты уже авторитет в своём отделе.
- Гуру (1000–1500 баллов) – коллеги тебя ищут, ты даёшь советы.
- Мастер (1500–2000 баллов) – легенда своего направления.
`;

const text2 = `
Баллы ты получаешь за активность в боте и участие в корпоративных процессах:

- Прохождение еженедельного квиза — +10
- Правильный ответ в квизе — +2
- Повторное прохождение квиза — +5
- Общение со случайным коллегой — +15
- Отправка отзыва или идеи — +10
- Участие в событиях банка — +20
- Использование бота 7 дней подряд — +10 бонусных
- Получение нового уровня — +50 бонусных
`;

const text3 = `
За определённые действия ты можешь получить забавные и полезные значки, например:

- Книжный червь – пройдено 5 тестов подряд  
- Социальный лиценз – общался(ась) с 5 случайными коллегами  
- Голова года – правильно ответил(а) на все вопросы недели  
- Стабильность – использовал(а) бота 7 дней подряд  
- Звезда Альфы – вошёл(а) в топ рейтинга за месяц  
- Энциклопедия – повторил(а) 3 квиза  
- Нинзя – все тесты пройдены без ошибок за неделю  
- Как Лекси – поделился(ась) шуткой или анекдотом с командой
`;

const text4 = `
Каждую субботу формируется топ-10 самых активных сотрудников:

- 1 место – иммунитет от одной внутренней рассылки (шутка!)  
- 2–3 места – эксклюзивные ачивки в ATeam  
- 4–10 места – мерч от Лекси: наклейки, кружка, футболка  
- Все участники – благодарность от Лекси в виде голосового сообщения или смешной анимации  
`;

export const my_balls_and = {
  levels: {
    label: '🏆 Уровни и регалии',
    text: text1,
  },
  points: {
    label: '💰 Как начисляются баллы?',
    text: text2,
  },
  badges: {
    label: '🏅 Значки и достижения',
    text: text3,
  },
  rating: {
    label: '📊 Еженедельный рейтинг',
    text: text4,
  },
};
